// ============================================================================
// Error strings
// ----------------------------------------------------------------------------
"ERROR_BOOTVOL" = "이 소프트웨어는 시동 볼륨에만 설치될 수 있습니다.";
"ERROR_INSTALL" = "선택한 볼륨은 이 업데이트의 요구사항을 만족하지 않습니다.";

"Newer_Package_Installed_message" = "카멜레온의 더 새로운 버전이 이미 설치되어 있습니다.";
"Intel_Mac_message" = "이 소프트웨어는 이 컴퓨터에 설치될 수 없습니다.";


// ============================================================================
// Install Type
// ----------------------------------------------------------------------------
"InstallType_title" = "설치 유형";
"InstallType_description" = "새 설치나 업그레이드 둘 중 하나를 선택하세요.";

"New_title" = "새 설치";
"New_description" = "Bootloader 이외의 옵션이 추가로 선택된 경우, 만약 설치할 파티션에 /Extra 폴더가 이미 존재하면, 다른 이름으로 백업한 후, 추가 선택한 옵션들이 포함된 새로운 /Extra 폴더가 생성됩니다.";

"Upgrade_title" = "업그레이드";
"Upgrade_description" = "Bootloader 이외의 옵션이 추가로 선택된 경우 만약 설치할 파티션에 /Extra 폴더가 이미 존재하면, 다른 이름으로 백업한 후, 기존 /Extra 폴더에 추가 선택한 옵션들이 더해집니다. (org.chameleon.Boot.plist 기존 항목들을 덮어 쓰기 하지 않고 이미 없는 옵션들만 추가합니다.)";


// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------
"Chameleon_title" = "카멜레온 부트로더 ";
"Chameleon_description" = "카멜레온 부트로더는 다음과 같은 세 개의 파일을 필요로 합니다. (간단히 설명해서)
boot0 (드라이브의 MBR에 있음) boot1로딩을 담당.
boot1 (파티션의 부트 섹터에 있음) boot2의 위치를 알려줌.
boot2 (드라이브의 루트 디렉토리에 있음) 커널 로딩 등 기타 담당.";

"Standard_title" = "일반";
"Standard_description" = "선택된 파티션의 루트 디렉토리에 카멜레온에 필요한 파일들을 사용자의 시스템에 따라 boot0 또는 boot0md를 이용하여 설치합니다. 윈도우가 설치되있더라도 영향을 주지 않습니다.";

"EFI_title" = "EFI";
"EFI_description" = "평상 시 숨겨져있는 EFI 시스템 파티션에 카멜레온에 필요한 파일들을 사용자의 시스템에 따라 boot0 또는 boot0md를 이용하여 설치합니다. 윈도우가 설치되있더라도 영향을 주지 않습니다.";

"noboot_title" = "부트로더를 설치하지 않음";
"noboot_description" = "이미 부트로더가 설치되있을 경우 사용자가 기타 옵션들을 설치하고자 할 때 유용합니다.";


// ============================================================================
// Modules
// ----------------------------------------------------------------------------
"Module_title" = "모듈";
"Module_description" = "카멜레온에 통합된 모듈 시스템은 사용자나 개발자가 메인 부트 파일을 바꾸지 않고 카멜레온의 핵심 기능을 연장할 수 있게 해줍니다.";


"klibc_title" = "klibc";
"klibc_description" = "이 모듈은 만약 카멜레온이 부족할시 다른 모듈들이 연결할 수 있는 C 표준 라이브러리를 제공합니다.
현재 uClibc++ 라이브러리에서만 사용되고 있습니다.
소스: (영문)http://www.kernel.org/pub/linux/libs/klibc/";

"AutoReso_title" = "화면 해상도";
"AutoReso_description" = "이 모듈은 기본 모니터로부터 EDID 정보를 읽습니다.
현재 이 모듈은 트렁크에 통합되지 않고 있고, 또 쓸모가 적습니다.
추가로, Intel사의 HD 시리즈 전 그래픽카드들이 사용할 수 있는 VESA 모드를 패치하여 부팅 중 올바른 해상도를 가질 수 있게 해줍니다.";

"uClibc_title" = "uClibc++";
"uClibc_description" = "이 모듈은 다른 모듈들을 위한 최소화적인 c++ 런타임 라이브러리를 제공합니다.
이 모듈은 특별한 기능 없이 c++ 언어가 다른 모듈들에 의해 사용될 수 있도록 해 줍니다.
실행시간 데이터형 정보(RTTI)와 예외 처리(Exceptions)는 비활성화된점 참고하시기 바랍니다. 
소스: (영문) http://cxx.uclibc.org/
의존 관계(Dependencies): klibc";

"Keylayout_title" = "키레이아웃";
"Keylayout_description" = "이 모듈은 사용자 키보드 키 매핑 정의를 허용합니다.";


// ============================================================================
// Utility
// These are currently unused!!!
// ----------------------------------------------------------------------------
"Utility_title" = "유틸리티";
"Utility_description" = "설치를 도우는 선택적인 파일들";

"PrefPanel_title" = "환경 설정 패널";
"PrefPanel_description" = "카멜레온의 환경 설정 패널을 설치함.";

"SMBIOS_title" = "SMBIOS.plist";
"SMBIOS_description" = "/Extra/Configuration 폴더 안에 smbios.plist 예제 파일을 만듭니다.";

"Documentation_title" = "사용 설명서";
"Documentation_description" = "카멜레온 부트로더를 설치하고, 이용하는 데에 대한 사용 설명서";


// ============================================================================
// Boot Options - The follow options are split to match the layout OptionalSettings text files.
// but they can be changed to suit however anyone wants to do it.
// ----------------------------------------------------------------------------

"Options_title" = "환경 설정";
"Options_description" = "/Extra 폴더안에 드롭다운 메뉴에서 선택한 항목들을 포함한 org.chameleon.Boot.plist 파일을 생성합니다.";

"BootBanner_title" = "배너 사용안함(BootBanner=No)";
"BootBanner_description" = "선택 시 GUI에 표시되는 카멜레온 부트로더 배너를 숨깁니다. 좌측 상단 모서리에 위치한 배너는 릴리스 버전 등을 텍스트로 보여줍니다.";

"GUI_title" = "명령어 모드(GUI=No)";
"GUI_description" = "선택 시 카멜레온에 원래 사용되는 그래픽 유저 인터페이스를 끕니다. 비선택 시에는 파티션 선택 화면에서 Tab키로 전환이 가능합니다.";

"LegacyLogo_title" = "맥 부팅 스크린(LegacyLogo=Yes)";
"LegacyLogo_description" = "선택 시 오리지널 맥과 같은 짙은 회색 애플 로고밑에 돌아가는 휠과 밝은 회색 배경을 부팅 스크린으로 사용합니다. 비선택 시 /Extra/Theme 폴더 안의  boot.png 사진을 사용";

"InstantMenu_title" = "자동 부팅 사용 안함(InstantMenu=Yes)";
"InstantMenu_description" = "선택 시 매번 사용자가 직접 부팅할 파티션을 고릅니다. 고르고 엔터를 누르기 전까지 OS부팅을 하지 않습니다. 비선택 시 카멜레온이 로딩 중 기본 파티션 아이콘과 자동 부팅까지 남은 시간을 막대기로 보여 줍니다. 이때 멀티 부팅을 위해 아무키나 입력해 자동 부팅을 취소할 수 있습니다.";

"QuietBoot_title" = "부팅과정 숨김(QuietBoot=Yes)";
"QuietBoot_description" = "선택 시 오리지널 맥과 같이 부팅 스크린으로 바로 부팅합니다. 주의 할 점은 파티션 선택이나 명령어(Kernel Flag)입력이 불가능하며 오직 org.chameleon.Boot.plist 파일 안에 지정된 기본 파티션과 Kernel Flag가 적용됩니다. 참고로, 기본 파티션이 윈도우로 설정될 경우 맥 부팅으로 수정이 어렵고 맥OS 상에서 선택한 시동 볼륨은 부트로더에 전달이 되지않으며 무시됩니다.";

"ShowInfo_title" = "카멜레온 정보 표시(ShowInfo=Yes)";
"ShowInfo_description" = "선택 시 파티션, 화면 해상도 상세정보를 부트로더 배너 아래에 표시합니다. 문제 해결할 때 유용한 정보를 보여주지만 특정 테마들과 겹칠 수 있습니다.";

"Wait_title" = "부트로더 로그 보기(Wait=Yes)";
"Wait_description" = "선택 시 맥 커널을 로딩하기 직전에 부팅 과정을 일시 정지하고 자세한 로그를 보여줍니다. q키 입력으로 부팅을 계속 진행할 수 있습니다.";

// ----------------------------------------------------------------------------

"arch_title" = "32비트 모드(arch=i386)";
"arch_description" = "선택 시 커널이 32비트 모드로 부팅합니다. 비선택 시 64비트 모드.";

"EHCIacquire_title" = "EHCI확보(EHCIacquire=Yes)";
"EHCIacquire_description" = "선택 시 에러가 있는 바이오스로 인한 어떠한 EHCI 권한 오류라도 고칩니다.";

"EthernetBuiltIn_title" = "내장형 이더넷(EthernetBuiltIn=Yes)";
"EthernetBuiltIn_description" = "선택 시 네트워크 카드들을 '내장형'으로 만듭니다.";

"ForceHPET_title" = "강제HPET(ForceHPET=Yes)";
"ForceHPET_description" = "선택 시 바이오스가 지원하지 않더라도 Intel 칩셋에서 HPET를 사용하게 합니다.";

"ForceWake_title" = "강제 깨우기(ForceWake=Yes)";
"ForceWake_description" = "선택 시 잠자기때 저장한 이미지가 에러난 경우 우회합니다.";

"RestartFix_title" = "재시동 안고침(RestartFix=No)";
"RestartFix_description" = "선택 시  카멜레온이 재시동 에러를 고치지 않습니다.";

"UHCIreset_title" = "UHCI 리셋함(UHCIreset=Yes)";
"UHCIreset_description" = "선택 시 OS X를 시작하기 전에 UHCI 컨트롤러들을 리셋합니다.";

"UseMemDetect_title" = "자동 메모리 인식 안함(UseMemDetect=No)";
"UseMemDetect_description" = "선택 시 자동 RAM인식을 끕니다";

"UseKernelCache_title" = "커널 캐시 사용(UseKernelCache=Yes)";
"UseKernelCache_description" = "Lion 전용. 선택 시 이전에 저장된 커널 로딩을 사용합니다. /E/E와 /S/L/E를 우회하기 때문에 필요한 모든 것을 캐시에 저장 후에 사용하세요.";

"Wake_title" = "깨우기 시도함(Wake=Yes)";
"Wake_description" = "선택 시 마지막 최대 절전 모드 이미지를 로딩 시도합니다.";

// ----------------------------------------------------------------------------

"CSTUsingSystemIO_title" = "SystemIO를 이용한 CST생성(CSTUsingSystemIO=Yes)";
"CSTUsingSystemIO_description" = "새로운 C-State _CST 생성 방법으로, 선택 시 기존의 FixedHW대신 SystemIO registers를 사용합니다.";

"DropSSDT_title" = "마더보드 SSDT 버림(DropSSDT=Yes)";
"DropSSDT_description" = "선택 시 마더보드에 포함된 SSDT 표를 버립니다.";

"EnableC2State_title" = "C2단계 사용(EnableC2State=Yes)";
"EnableC2State_description" = "선택 시 특정한 CPU 파워 단계 C2를 사용.";

"EnableC3State_title" = "C3단계 사용(EnableC3State=Yes)";
"EnableC3State_description" = "선택 시 특정한 CPU 파워 단계 C3를 사용.";

"EnableC4State_title" = "C4단계 사용(EnableC4State=Yes)";
"EnableC4State_description" = "선택 시 특정한 CPU 파워 단계 C4를 사용.";

"GenerateCStates_title" = "C-State 생성(Generate C-States=Yes)";
"GenerateCStates_description" = "선택 시 유휴 상태 CPU단계들(C-States)을 자동 활성화 합니다.";

"GeneratePStates_title" = "P-State 생성(Generate P-States=Yes)";
"GeneratePStates_description" = "선택 시 활동 상태 CPU단계들(P-States)을 자동 활성화 합니다.";

// ----------------------------------------------------------------------------

"1024x600x32_title" = "1024x600x32";
"1024x600x32_description" = "부팅 해상도 및 색심도를 1024x600x32";

"1024x768x32_title" = "1024x768x32";
"1024x768x32_description" = "부팅 해상도 및 색심도를 1024x768x32";

"1280x768x32_title" = "1280x768x32";
"1280x768x32_description" = "부팅 해상도 및 색심도를 1280x768x32";

"1280x800x32_title" = "1280x800x32";
"1280x800x32_description" = "부팅 해상도 및 색심도를 1280x800x32";

"1280x1024x32_title" = "1280x1024x32";
"1280x1024x32_description" = "부팅 해상도 및 색심도를 1280x1024x32";

"1280x960x32_title" = "1280x960x32";
"1280x960x32_description" = "부팅 해상도 및 색심도를 1280x960x32";

"1440x900x32_title" = "1440x900x32";
"1440x900x32_description" = "부팅 해상도 및 색심도를 1440x900x32";

"1600x900x32_title" = "1600x900x32";
"1600x900x32_description" = "부팅 해상도 및 색심도를 1600x900x32";

"1600x1200x32_title" = "1600x1200x32";
"1600x1200x32_description" = "부팅 해상도 및 색심도를 1600x1200x32";

"1680x1050x32_title" = "1680x1050x32";
"1680x1050x32_description" = "부팅 해상도 및 색심도를 1680x1050x32";

"1920x1080x32_title" = "1920x1080x32";
"1920x1080x32_description" = "부팅 해상도 및 색심도를 1920x1080x32";

"1920x1200x32_title" = "1920x1200x32";
"1920x1200x32_description" = "부팅 해상도 및 색심도를 1920x1200x32";

// ----------------------------------------------------------------------------

"GraphicsEnabler_title" = "그래픽활성화(GraphicsEnabler=Yes)";
"GraphicsEnabler_description" = "NVIDIA GPU 기반의 그래픽카드를 자동 탐색하여 OS X에서 인식할 수 있게 잡아줍니다.";

"UseAtiROM_title" = "커스텀ATi롬 사용(UseAtiROM=Yes)";
"UseAtiROM_description" = "Extra폴더안에 있는 ATi롬 파일을 그래픽 카드 롬 대신 사용합니다.";

"UseNvidiaROM_title" = "커스텀Nvidia롬 사용(UseNvidiaROM=Yes)";
"UseNvidiaROM_description" = "Extra폴더안에 있는 Nvidia롬 파일을 그래픽 카드 롬 대신 사용합니다.";

"VBIOS_title" = "VBIOS 인식(VBIOS=Yes)";
"VBIOS_description" = "VBIOS를 device-properties에 넣어줌";

// ----------------------------------------------------------------------------
// Boot options - KERNEL FLAGS
// ----------------------------------------------------------------------------

"Verbose_title" = "부팅 로그 표시(상세 모드 aka, verbose mode)";
"Verbose_description" = "선택 시 사용자가 카멜레온과 OS X 커널 메세지를 실시간으로 보게 합니다. 부팅 스크린이 비활성화되며 콘솔에 커널 로그를 남깁니다. 문제 해결에 필수 요소.";

"Singleusermode_title" = "단일 사용자 모드";
"Singleusermode_description" = "문제 해결을 위한 옵션으로, 선택 시 OS X의 BSD/UNIX 커맨드 라인으로 부팅합니다.";

"Ignorecaches_title" = "캐시 무시";
"Ignorecaches_description" = "선택 시 커널이 이전에 저장된 캐시를 무시하고 모든 파일들을 시스템 폴더로부터 로드 합니다.";

"Npci_title" = "npci=0x2000";
"Npci_description" = "몇몇 시스템에서 볼 수 있는 'PCI configurationbegin'과 함께 나타나는 멈춤 현상을 고치는 대 쓰입니다. IOPCIFamily 소스 코드에서 볼 수 있는 0x2000은 kIOPCIConfiguratorPFM64 플래그입니다.";

"Npci3_title" = "npci=0x3000";
"Npci3_description" = "몇몇 시스템에서 볼 수 있는 'PCI configurationbegin'과 함께 나타나는 멈춤 현상을 고치는 대 쓰입니다. IOPCIFamily 소스 코드에서 볼 수 있는 0x3000은 kIOPCIConfiguratorPFM64 플래그입니다.";

"Darkwake_title" = "저전력 깨우기 끔(darkwake=0)";
"Darkwake_description" = "Lion전용. 선택 시 잠자기 모드에서 깨어난 후 가끔 화면이 안 켜질 수 있는 '저전력 깨우기' 기능을 끕니다.";


// ----------------------------------------------------------------------------
// Boot options - KEYMAPS
// ----------------------------------------------------------------------------

"mac-de_title" = "독일어 맥 키보드";
"mac-de_description" = "독일어 맥 키보드를 위한 키보드 레이아웃을 사용합니다.";

"mac-es_title" = "스페인어 맥 키보드";
"mac-es_description" = "스페인어 맥 키보드를 위한 키보드 레이아웃을 사용합니다.";

"mac-fr_title" = "불어 맥 키보드";
"mac-fr_description" = "불어 맥 키보드를 위한 키보드 레이아웃을 사용합니다.";

"mac-it_title" = "이탈리아어 맥 키보드";
"mac-it_description" = "이탈리아어 맥 키보드를 위한 키보드 레이아웃을 사용합니다.";

"mac-se_title" = "스웨덴어 맥 키보드";
"mac-se_description" = "스웨덴어 맥 키보드를 위한 키보드 레이아웃을 사용합니다.";

"mac-pt_title" = "포르투갈어 맥 키보드";
"mac-pt_description" = "포르투갈어 맥 키보드를 위한 키보드 레이아웃을 사용합니다.";

"pc-de_title" = "독일어 PC 키보드";
"pc-de_description" = "독일어 PC 키보드를 위한 키보드 레이아웃을 사용합니다.";

"pc-es_title" = "스페인어 PC 키보드";
"pc-es_description" = "스페인어 PC 키보드를 위한 키보드 레이아웃을 사용합니다.";

"pc-fr_title" = "불어 PC 키보드";
"pc-fr_description" = "불어 PC 키보드를 위한 키보드 레이아웃을 사용합니다.";

"pc-it_title" = "이탈리아어 PC 키보드";
"pc-it_description" = "이탈리아어 PC 키보드를 위한 키보드 레이아웃을 사용합니다.";

"pc-se_title" = "스웨덴어 PC 키보드";
"pc-se_description" = "스웨덴어 PC 키보드를 위한 키보드 레이아웃을 사용합니다.";

"pc-pt_title" = "포르투갈어 PC 키보드";
"pc-pt_description" = "포르투갈어 PC 키보드를 위한 키보드 레이아웃을 사용합니다.";

// ----------------------------------------------------------------------------
// Boot options - THEMES
// ----------------------------------------------------------------------------

"Embed_title" = "Embed";
"Embed_description" = "Embedded 테마를 요구하는 카멜레온 버전을 제작할 때 사용되었던 새 기본 테마의 작고 심플한 버전입니다.";

"Legacy_title" = "Legacy";
"Legacy_description" = "카멜레온 v2.0 RC1에서 소개된 오리지널 기본 테마입니다.";

"Default_title" = "Standard";
"Default_description" = "카멜레온 v2.0 RC5에서 소개된 오리지널 기본 테마입니다.";

"Bullet_title" = "Bullet";
"Bullet_description" = "보기좋고 심플한 NoSmokingBandit님의 테마,  2009년 4월 작품.";


// ============================================================================
// The filenames from OptionalSettings text files' become sub menu headings.
// These sub menu headings need titles and descriptions.
// ----------------------------------------------------------------------------
// Control

"Control_title" = "부팅 화면 조정";
"Control_description" = "전체적인 부팅 화면을 커스터마이징할 수 있습니다.";

// General
"General_title" = "기본 기능 조정";
"General_description" = "부트로더에 포함된 기본 기능들을 켜고 끌 수 있습니다.";

// KernelFlags
"KernelFlags_title" = "커널 플래그(Kernel Flags)";
"KernelFlags_description" = "OS X 부팅 시 사용되는 커널 플래그를 정합니다.";

// PowerManagement
"PowerManagement_title" = "전원 관리";
"PowerManagement_description" = "Intel SpeedStep과 전원 관리에 사용되는 데이터를 부트로더가 자동으로 찾아주는 옵션들입니다.";

// Resolution
"Resolution_title" = "화면 해상도";
"Resolution_description" = "부팅 시 사용될 한 해상도를 선택하거나 고르지 않으려면 선택 안함을 선택하세요.";

// Video
"Video_title" = "그래픽";
"Video_description" = "그래픽 카드들과 관련된 옵션들입니다";

// Keymaps
"Keymaps_title" = "키 레이아웃";
"Keymaps_description" = "부팅 시 적용될 키 레이아웃에서 사용하는 키보드와 맞는것을, 아니면 없음을 선택하세요.
선택 시 필요한 키 레이아웃 모듈과 키 맵을 추가로 설치합니다.";

// Themes
"Themes_title" = "테마";
"Themes_description" = "샘플 테마들을 모아놓았습니다. 더 많은 테마는 다음 주소에서 찾으실 수 있습니다: 
http://forum.voodooprojects.org/index.php/board,7.0.html";


// ============================================================================
// Exclusive boot options string - These are added automatically by buildpkg
// Name to be used should be ChooseNone-xxxxxx
// Where xxxxx = the name of the BootOptions file (minus the .txt)
// ----------------------------------------------------------------------------
"ChooseNone-Resolution_title" = "선택 안함";
"ChooseNone-Resolution_description" = "화면 해상도 고르지 않음";

"ChooseNone-keylayout_title" = "없음";
"ChooseNone-keylayout_description" = "맞는 키 레이아웃 없음";
